In [ ]:
import pandas as pd
import numpy as np

In [ ]:

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm',
'Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [ ]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [ ]:
# 1.

df.iloc[1,1],df.iloc[3,1]=10055,10075

df['FlightNumber']=df['FlightNumber'].astype('int')

print(df)
print('-'*60)
print(df.dtypes)

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"
------------------------------------------------------------
From_To         object
FlightNumber     int64
RecentDelays    object
Airline         object
dtype: object

In [ ]:
# 2.
df1=pd.DataFrame([i.split('_') for i in df['From_To']],columns=['From','To'])
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [ ]:
#3.

df2=pd.DataFrame([i.upper().split('_') for i in df['From_To']],columns=['From','To'])
df1

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [ ]:
# 4.

df.pop('From_To')

0        LoNDon_paris
1        MAdrid_miLAN
2    londON_StockhOlm
3      Budapest_PaRis
4     Brussels_londOn
Name: From_To, dtype: object

In [ ]:
df=pd.concat([df2,df],axis=1)

In [ ]:
df

       From         To  FlightNumber  RecentDelays              Airline
0    LONDON      PARIS         10045      [23, 47]               KLM(!)
1    MADRID      MILAN         10055            []    <Air France> (12)
2    LONDON  STOCKHOLM         10065  [24, 43, 87]  (British Airways. )
3  BUDAPEST      PARIS         10075          [13]       12. Air France
4  BRUSSELS     LONDON         10085      [67, 32]          "Swiss Air"

In [ ]:
# 5.

dlay=df.pop('RecentDelays')
dlay

0        [23, 47]
1              []
2    [24, 43, 87]
3            [13]
4        [67, 32]
Name: RecentDelays, dtype: object

In [ ]:
dlay_df=pd.DataFrame([i for i in dlay],columns=['Dlay_1','Dlay_2','Dlay_3'])
dlay_df

   Dlay_1  Dlay_2  Dlay_3
0    23.0    47.0     NaN
1     NaN     NaN     NaN
2    24.0    43.0    87.0
3    13.0     NaN     NaN
4    67.0    32.0     NaN

In [ ]:
new_df=pd.concat([df,dlay_df],axis=1)
new_df

       From         To  FlightNumber  ... Dlay_1  Dlay_2  Dlay_3
0    LONDON      PARIS         10045  ...   23.0    47.0     NaN
1    MADRID      MILAN         10055  ...    NaN     NaN     NaN
2    LONDON  STOCKHOLM         10065  ...   24.0    43.0    87.0
3  BUDAPEST      PARIS         10075  ...   13.0     NaN     NaN
4  BRUSSELS     LONDON         10085  ...   67.0    32.0     NaN

[5 rows x 7 columns]